// Объект Math:

console.log(Math.ceil(1.00001)) // 2 (округляет в большую сторону)

console.log(Math.floor(1.9)) // 1 (округляет в меньшую сторону)

console.log(Math.round(1.5)) // 2 (округляет в ближайшую сторону)
console.log(Math.round(1.49)) // 1 (округляет в ближайшую сторону)
console.log(Math.round(1.51)) // 2 (округляет в ближайшую сторону)

console.log(Math.trunc(1.521211)) // 1 (удаляет дробную часть без округления)

console.log(Math.abs(-10)) // 10 (преобразование отрицательного числа в положительное)
console.log(-Math.abs(10)) // -10 (преобразование положительного числа в отрицательное)

console.log(Math.pow(2, 10)) // (возвращает число возведенное в степень) (2 в степени 10 = 1024)

console.log(Math.random()) // 0.769070025203584 (возвращает рандомное число в диапазоне от 0 (включительно) до 1 (но не включая 1))
console.log(Math.random()) // 0.769070025203584 (возвращает рандомное число в диапазоне от 0 (включительно) до 1 (но не включая 1))
console.log(Math.random()) // 0.45417562735470396 (возвращает рандомное число в диапазоне от 0 (включительно) до 1 (но не включая 1))

console.log(Math.max(1, 2, 3, 4, 5, 6, 7, 8, 9)) // 9 (возвращает наибольшее число из перечисленных аргументов)

console.log(Math.min(1, 2, 3, 4, 5, 6, 7, 8, 9)) // 1 (возвращает наименьшее число из перечисленных аргументов)
