// однострочный комментарий

/*
многострочный
комментарий
*/

console.log("hello world"); // инструкция

var a // объявленная переменная a, с помощью ключевого слова var,
let b // объявленная переменная b, с помощью ключевого слова let,
const c = 1 // объявленная переменная c, с помощью ключевого слова const, в которой присвоено значение 1

// = Оператор присваивания
// Операнд - то, к чему применяется оператор

// Унарный оператор - оператор, который применяется к одному операнду
// Бинарный оператор - оператор, который применяется к двум операндам

let x = 1
let y = 2
x = -x // унарный оператор -, который применен к одному операнду x
y - x // бинарный оператор +, который применен к двум операндам
