console.log(Math.ceil(1.1)) // 2 ( Округляет в большую сторону )
console.log(Math.floor(1.9)) // 1 ( Округляет в меньшую сторону )
console.log(Math.round(1.4)) // 1 ( Округляет к ближайшему целому )

console.log(Math.trunc(1.9)) // 1 ( Удаляет дробную часть, без округления )

console.log(Math.max(1, 2, 3)) // 3 ( Возвращает наибольшее число )
console.log(Math.min(1, 2, 3)) // 1 ( Возвращает наименьшее число )

console.log(Math.random()) // 0.9.. ( Возвращает рандомное число с плавающей запятой, от 0 до 1, не считая 1 )

console.log(Math.abs(-10)) // 10 ( Преобразовывает отрицательные числа в положительные )
console.log(-Math.abs(10)) // -10 ( Преобразовывает положительные числа в отрицательные )

console.log(Math.pow(2, 2)) // 4 ( Возвращает число возведенное в степень )